app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "My First Post"], ["body", "Some Stuff.."], ["description", ""], ["slug", "my-first-post"], ["created_at", "2019-09-13 04:28:06.596004"], ["updated_at", "2019-09-13 04:28:06.596004"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "description" = ?, "slug" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My First Post Yeah"], ["description", "desc"], ["slug", "my-first-post-yeah"], ["updated_at", "2019-09-13 04:29:00.379195"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.friendly.find(params[:id])